# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [3]:
import pandas as pd

In [4]:
url1='https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
url2='https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
url3='https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv'
df1 = pd.read_csv(url1)
df2 = pd.read_csv(url2)
df3 = pd.read_csv(url3)

In [5]:
df1.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [6]:
df2.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

In [7]:
df3.head(3)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car

In [8]:
df1.shape

(4008, 11)

In [9]:
df2.shape

(996, 11)

In [10]:
df3.shape

(7070, 11)

In [11]:
df1.dtypes

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

In [12]:
df2.dtypes

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                         int64
Monthly Premium Auto           int64
Number of Open Complaints     object
Total Claim Amount           float64
Policy Type                   object
Vehicle Class                 object
dtype: object

In [13]:
df3.dtypes

Customer                      object
State                         object
Customer Lifetime Value      float64
Education                     object
Gender                        object
Income                         int64
Monthly Premium Auto           int64
Number of Open Complaints      int64
Policy Type                   object
Total Claim Amount           float64
Vehicle Class                 object
dtype: object

In [14]:
df1.columns = df1.columns.str.lower().str.replace(' ', '_')
df1.rename(columns={'st': 'state'}, inplace=True)
df1.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [15]:
df2.columns = df2.columns.str.lower().str.replace(' ', '_')
df2.rename(columns={'st': 'state'}, inplace=True)
df2.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [16]:
df3.columns = df3.columns.str.lower().str.replace(' ', '_')
df3.columns

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [17]:
# Replace values in 'gender'
df1['gender'] = df1['gender'].replace({'female': 'F', 'Femal': 'F', 'F': 'F','Male': 'M', 'M': 'M'})
df2['gender'] = df2['gender'].replace({'female': 'F', 'Femal': 'F', 'F': 'F','Male': 'M', 'M': 'M'})
df3['gender'] = df3['gender'].replace({'female': 'F', 'Femal': 'F', 'F': 'F','Male': 'M', 'M': 'M'})

In [18]:
#Check unique values of column
df1['gender'].value_counts()

gender
F    502
M    452
Name: count, dtype: int64

In [19]:
#Check unique values of column
df2['gender'].value_counts()

gender
F    529
M    462
Name: count, dtype: int64

In [20]:
#Check unique values of column
df3['gender'].value_counts()

gender
F    3576
M    3494
Name: count, dtype: int64

In [21]:
#Replace accronyms in states
df1['state'] = df1['state'].replace({'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington', 'NV': 'Nevada','OR': 'Oregon'})
df2['state'] = df2['state'].replace({'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington', 'NV': 'Nevada','OR': 'Oregon'})
df3['state'] = df3['state'].replace({'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington', 'NV': 'Nevada','OR': 'Oregon'})

In [22]:
df1['state'].value_counts()

state
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: count, dtype: int64

In [23]:
df2['state'].value_counts()

state
Oregon        303
California    277
Arizona       191
Nevada        125
Washington    100
Name: count, dtype: int64

In [24]:
df3['state'].value_counts()

state
California    2544
Oregon        1978
Arizona       1302
Nevada         659
Washington     587
Name: count, dtype: int64

In [25]:
#correction in education
df1['education'] = df1['education'].replace('Bachelors', 'Bachelor')
df2['education'] = df2['education'].replace('Bachelors', 'Bachelor')
df3['education'] = df3['education'].replace('Bachelors', 'Bachelor')

In [26]:
df1['education'].value_counts()

education
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: count, dtype: int64

In [27]:
df2['education'].value_counts()

education
College                 311
High School or Below    290
Bachelor                260
Master                   86
Doctor                   49
Name: count, dtype: int64

In [28]:
df3['education'].value_counts()

education
Bachelor                2152
College                 2058
High School or Below    2030
Master                   572
Doctor                   258
Name: count, dtype: int64

In [29]:
# Remove % customer_lifetime_value first convert to str to replace (aviod error) then convert back to float
df1['customer_lifetime_value'] = df1['customer_lifetime_value'].astype(str).str.replace('%', '').astype(float)
df2['customer_lifetime_value'] = df2['customer_lifetime_value'].astype(str).str.replace('%', '').astype(float)
df3['customer_lifetime_value'] = df3['customer_lifetime_value'].astype(str).str.replace('%', '').astype(float)

In [30]:
df1['customer_lifetime_value'].value_counts()

customer_lifetime_value
445811.34     4
251459.20     4
272535.64     3
578018.22     3
684615.03     3
             ..
245357.08     1
507566.27     1
321497.94     1
1227534.31    1
899704.02     1
Name: count, Length: 1027, dtype: int64

In [31]:
df2['customer_lifetime_value'].value_counts()

customer_lifetime_value
552821.28     4
600521.48     3
538949.95     3
1203662.05    3
871704.98     3
             ..
728503.10     1
1765196.34    1
1702989.34    1
403931.50     1
399258.39     1
Name: count, Length: 950, dtype: int64

In [32]:
df3['customer_lifetime_value'].value_counts()

customer_lifetime_value
2647.519741     6
2659.705650     6
4686.469674     6
4270.034394     6
13727.799720    6
               ..
11281.524510    1
8759.592518     1
4928.001408     1
4896.261605     1
2611.836866     1
Name: count, Length: 6288, dtype: int64

In [33]:
#To replace cars to luxury
df1['vehicle_class'] = df1['vehicle_class'].replace({'Sports Car': 'Luxury', 'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury'})
df2['vehicle_class'] = df2['vehicle_class'].replace({'Sports Car': 'Luxury', 'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury'})
df3['vehicle_class'] = df3['vehicle_class'].replace({'Sports Car': 'Luxury', 'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury'})

In [34]:
df1['vehicle_class'].value_counts()

vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: count, dtype: int64

In [35]:
df2['vehicle_class'].value_counts()

vehicle_class
Four-Door Car    519
Two-Door Car     211
SUV              174
Luxury            92
Name: count, dtype: int64

In [36]:
df3['vehicle_class'].value_counts()

vehicle_class
Four-Door Car    3546
Two-Door Car     1480
SUV              1401
Luxury            643
Name: count, dtype: int64

In [37]:
#data cleaning on number_of_open_complaint
df2['number_of_open_complaints'].value_counts()

number_of_open_complaints
1/0/00    796
1/1/00    109
1/2/00     43
1/3/00     26
1/4/00     16
1/5/00      6
Name: count, dtype: int64

In [38]:
#To retrieve the number in the middle of / with index 1 
df1['number_of_open_complaints'] = df1['number_of_open_complaints'].astype(str).str.split('/').str[1]
df2['number_of_open_complaints'] = df2['number_of_open_complaints'].astype(str).str.split('/').str[1]
df3['number_of_open_complaints'] = df3['number_of_open_complaints'].astype(str).str.split('/').str[1]

In [39]:
df1['number_of_open_complaints'].dtype

dtype('O')

In [40]:
df1['customer_lifetime_value'].dtype

dtype('float64')

In [41]:
df1.sample(10)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
2180,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
250,IA63417,Arizona,F,High School or Below,400151.91,19782.0,108.0,0,Personal Auto,Two-Door Car,773.470977
204,FL34139,California,M,High School or Below,368811.09,0.0,63.0,3,Personal Auto,Four-Door Car,669.682001
3023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1359,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3609,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
876,ZE85014,California,M,College,235774.70,25064.0,62.0,0,Personal Auto,Four-Door Car,297.600000
3812,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
# converting back to numberic
df1['customer_lifetime_value'] = pd.to_numeric(df1['customer_lifetime_value'], errors='coerce')
df2['customer_lifetime_value'] = pd.to_numeric(df2['customer_lifetime_value'], errors='coerce')
df3['customer_lifetime_value'] = pd.to_numeric(df3['customer_lifetime_value'], errors='coerce')

df1['number_of_open_complaints'] = pd.to_numeric(df1['number_of_open_complaints'], errors='coerce')
df2['number_of_open_complaints'] = pd.to_numeric(df2['number_of_open_complaints'], errors='coerce')
df3['number_of_open_complaints'] = pd.to_numeric(df3['number_of_open_complaints'], errors='coerce')

In [162]:
#total_claim_amount rounding
df1['total_claim_amount'] = df1['total_claim_amount'].round(2)
df2['total_claim_amount'] = df2['total_claim_amount'].round(2)
df3['total_claim_amount'] = df3['total_claim_amount'].round(2)

In [180]:
#customer_lifetime_value rounding
df1['customer_lifetime_value'] = df1['customer_lifetime_value'].round(2)
df2['customer_lifetime_value'] = df2['customer_lifetime_value'].round(2)
df3['customer_lifetime_value'] = df3['customer_lifetime_value'].round(2)

In [58]:
df1.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints      int64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [60]:
df1.isnull().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [62]:
df2.isnull().sum()

customer                     0
state                        0
gender                       5
education                    0
customer_lifetime_value      4
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

In [64]:
df3.isnull().sum()

customer                        0
state                           0
customer_lifetime_value         0
education                       0
gender                          0
income                          0
monthly_premium_auto            0
number_of_open_complaints    7070
policy_type                     0
total_claim_amount              0
vehicle_class                   0
dtype: int64

In [66]:
#Dropping Nan where all the rows is Nan
df1.dropna(how="all",inplace=True)
df2.dropna(how="all",inplace=True)
df3.dropna(how="all",inplace=True)

In [68]:
df1.isnull().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

#In df1 gender and customer_life_time value have missing

In [70]:
df2.isnull().sum()

customer                     0
state                        0
gender                       5
education                    0
customer_lifetime_value      4
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

#In df2 gender and customer_life_time value have missing

In [72]:
df3.isnull().sum()

customer                        0
state                           0
customer_lifetime_value         0
education                       0
gender                          0
income                          0
monthly_premium_auto            0
number_of_open_complaints    7070
policy_type                     0
total_claim_amount              0
vehicle_class                   0
dtype: int64

In [102]:
#all values of df3 of column number_of_open_complaints is Nan
df3['number_of_open_complaints'].notna().sum()

0

In [74]:
df3.shape

(7070, 11)

#In df3 number_of_open_complaints all values is Nan

In [104]:
# For df1 and df2 filling with mean for customer_life_time columns as numerical value
df1['customer_lifetime_value'] = df1['customer_lifetime_value'].fillna(df1['customer_lifetime_value'].mean()).round(2)
df2['customer_lifetime_value'] = df2['customer_lifetime_value'].fillna(df2['customer_lifetime_value'].mean()).round(2)

In [134]:
# For df1 and df2 filling with first mode in for gender column (as there are multiple modes)
df1['gender'] = df1['gender'].fillna(df1['gender'].mode()[0])
df2['gender'] = df2['gender'].fillna(df2['gender'].mode()[0])

In [138]:
df1.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [124]:
df2.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

In [140]:
df1.shape

(1071, 11)

In [144]:
df3.shape

(7070, 11)

In [142]:
df2.shape

(996, 11)

In [184]:
# concatenate the DataFrames
combined_df = pd.concat([df1, df2, df3], ignore_index=True)

In [218]:
combined_df.shape

(9137, 11)

In [206]:
#fill in missing values of number_of_open_complaints in df3 with mean of this column in df1 and df3
# convert the mean to an integer before filling in missing values
mean_value = combined_df['number_of_open_complaints'].mean()
int_mean_value = int(round(mean_value))
combined_df['number_of_open_complaints'] = combined_df['number_of_open_complaints'].fillna(int_mean_value).astype(int)

In [216]:
combined_df['number_of_open_complaints'].value_counts()

number_of_open_complaints
0    8696
1     247
2      93
3      60
4      29
5      12
Name: count, dtype: int64

In [214]:
combined_df.sample(10)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
7506,MH13358,Oregon,F,High School or Below,2854.27,34807.0,73.0,0,Personal Auto,Two-Door Car,472.04
601,WO29605,Oregon,F,College,243687.51,48875.0,61.0,0,Personal Auto,Two-Door Car,1.84
4405,QS81789,Oregon,F,Bachelor,25107.10,24410.0,73.0,0,Corporate Auto,Four-Door Car,350.40
1128,GF17866,Oregon,F,College,387364.70,28142.0,105.0,0,Corporate Auto,Luxury,701.71
5439,VS30147,Oregon,M,Master,22118.81,58645.0,110.0,0,Personal Auto,SUV,427.72
8208,DN46994,California,F,Bachelor,5403.59,72633.0,67.0,0,Personal Auto,Four-Door Car,155.76
999,ZV32120,California,M,Doctor,397134.51,23599.0,103.0,0,Corporate Auto,SUV,494.40
7617,KB20508,California,M,College,10828.37,11033.0,97.0,0,Special Auto,Two-Door Car,511.12
36,KY38074,California,F,Bachelor,1389173.57,42305.0,117.0,0,Personal Auto,Four-Door Car,561.60
2737,MX80067,California,M,High School or Below,2509.27,74045.0,64.0,0,Personal Auto,Four-Door Car,307.20

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [200]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv"
df = pd.read_csv(url)

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [226]:
df.shape

(10910, 27)

In [202]:
# Clean column names if necessary
df.columns = df.columns.str.lower().str.replace(' ', '_')

In [222]:
df.sample(10)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
7430,7430,YV85096,Oregon,5272.005079,No,Basic,Bachelor,2011-02-19,Employed,F,...,8,Corporate Auto,Corporate L2,Offer1,Branch,176.287711,Four-Door Car,Medsize,A,2
5180,5180,WY97929,Arizona,8717.049833,Yes,Basic,College,2011-02-14,Employed,M,...,2,Special Auto,Special L1,Offer2,Agent,355.200000,Four-Door Car,Large,A,2
8145,8145,PJ36160,California,16272.743220,No,Basic,Bachelor,2011-02-09,Employed,M,...,2,Personal Auto,Personal L2,Offer3,Agent,366.039600,SUV,Small,A,2
6646,6646,XB97091,Arizona,37243.633120,No,Basic,High School or Below,2011-02-18,Employed,F,...,2,Personal Auto,Personal L1,Offer1,Web,295.335363,Sports Car,Medsize,A,2
3355,3355,MI13678,Oregon,2506.197852,No,Basic,High School or Below,2011-01-04,Employed,M,...,1,Personal Auto,Personal L3,Offer2,Branch,89.398794,Four-Door Car,Medsize,A,1
9193,9193,TK61994,Oregon,6104.501453,No,Extended,College,2011-02-28,Disabled,F,...,5,Personal Auto,Personal L2,Offer1,Agent,18.192921,Four-Door Car,Medsize,A,2
9669,9669,MY51849,Oregon,4903.810606,No,Basic,Bachelor,2011-02-22,Unemployed,F,...,8,Personal Auto,Personal L3,Offer1,Branch,469.609300,Four-Door Car,Large,A,2
1763,1763,SG86615,Oregon,14558.424240,No,Basic,High School or Below,2011-01-28,Employed,M,...,2,Personal Auto,Personal L1,Offer4,Web,299.505575,Four-Door Car,Medsize,A,1
5156,5156,YX36936,Arizona,4274.618943,No,Basic,College,2011-02-01,Employed,M,...,1,Corporate Auto,Corporate L3,Offer4,Agent,25.292113,SUV,Medsize,A,2
6431,6431,LO90345,Oregon,14472.583000,No,Basic,College,2011-02-24,Employed,F,...,5,Corporate Auto,Corporate L3,Offer2,Web,75.698305,Luxury SUV,Small,A,2

In [232]:
#Drop it as it is same as index
df.drop(columns=['unnamed:_0'], inplace=True)

In [238]:
df.shape

(10910, 26)

In [240]:
df.columns

Index(['customer', 'state', 'customer_lifetime_value', 'response', 'coverage',
       'education', 'effective_to_date', 'employmentstatus', 'gender',
       'income', 'location_code', 'marital_status', 'monthly_premium_auto',
       'months_since_last_claim', 'months_since_policy_inception',
       'number_of_open_complaints', 'number_of_policies', 'policy_type',
       'policy', 'renew_offer_type', 'sales_channel', 'total_claim_amount',
       'vehicle_class', 'vehicle_size', 'vehicle_type', 'month'],
      dtype='object')

In [242]:
df.dtypes

customer                          object
state                             object
customer_lifetime_value          float64
response                          object
coverage                          object
education                         object
effective_to_date                 object
employmentstatus                  object
gender                            object
income                             int64
location_code                     object
marital_status                    object
monthly_premium_auto               int64
months_since_last_claim          float64
months_since_policy_inception      int64
number_of_open_complaints        float64
number_of_policies                 int64
policy_type                       object
policy                            object
renew_offer_type                  object
sales_channel                     object
total_claim_amount               float64
vehicle_class                     object
vehicle_size                      object
vehicle_type                      object
month                              int64
dtype: object

In [244]:
df['state'].value_counts()

state
California    4183
Oregon        2909
Arizona       1937
Nevada         993
Washington     888
Name: count, dtype: int64

In [246]:
df['gender'].value_counts()

gender
F    5573
M    5337
Name: count, dtype: int64

In [248]:
df['response'].value_counts()

response
No     9444
Yes    1466
Name: count, dtype: int64

In [250]:
#rounding numerical columns to 2 decimals with help of AI to put is back to the df
df[df.select_dtypes(include=['float64', 'int64']).columns] = df.select_dtypes(include=['float64', 'int64',]).round(2)

In [252]:
df.head()

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,DK49336,Arizona,4809.22,No,Basic,College,2011-02-18,Employed,M,48029,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.80,Four-Door Car,Medsize,A,2
1,KX64629,California,2228.53,No,Basic,College,2011-01-18,Unemployed,F,0,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.92,Four-Door Car,Medsize,A,1
2,LZ68649,Washington,14947.92,No,Basic,Bachelor,2011-02-10,Employed,M,22139,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.00,SUV,Medsize,A,2
3,XL78013,Oregon,22332.44,Yes,Extended,College,2011-01-11,Employed,M,49078,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.01,Four-Door Car,Medsize,A,1
4,QA50777,Oregon,9025.07,No,Premium,Bachelor,2011-01-17,Medical Leave,F,23675,...,7,Personal Auto,Personal L2,Offer1,Branch,707.93,Four-Door Car,Medsize,A,1

In [254]:
df.isnull().sum()

customer                         0
state                            0
customer_lifetime_value          0
response                         0
coverage                         0
education                        0
effective_to_date                0
employmentstatus                 0
gender                           0
income                           0
location_code                    0
marital_status                   0
monthly_premium_auto             0
months_since_last_claim          0
months_since_policy_inception    0
number_of_open_complaints        0
number_of_policies               0
policy_type                      0
policy                           0
renew_offer_type                 0
sales_channel                    0
total_claim_amount               0
vehicle_class                    0
vehicle_size                     0
vehicle_type                     0
month                            0
dtype: int64

#create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail)

In [256]:
df['sales_channel'].value_counts()

sales_channel
Agent          4121
Branch         3022
Call Center    2141
Web            1626
Name: count, dtype: int64

In [262]:
#Total claim is considered as driver of sales, Agent drive the most sales revenue among other channels, web is the lowest
sales_summary = df.pivot_table(values='total_claim_amount', index='sales_channel', aggfunc='sum')
sales_summary

               total_claim_amount
sales_channel
Agent                  1810226.88
Branch                 1301204.34
Call Center             926601.02
Web                     706600.02

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [270]:
#average_customer_lifetime
average_customer_lifetime_summary = df.pivot_table(values='customer_lifetime_value',index='gender',columns='education',aggfunc='mean').round(2)
average_customer_lifetime_summary

education  Bachelor  College   Doctor  High School or Below   Master
gender
F           7874.27  7748.82  7328.51               8675.22  8157.05
M           7703.60  8052.46  7415.33               8149.69  8168.83

Among all eductions, average_customer_lifetime Highschool or below is the highest for female. and the lowest is for Female Doctor 
Generally men have the highest average_customer_lifetime.